/**
 * У Васи растет на подоконнике цветок.
 * Вася постоянно забывает его поливать, поэтому он купил датчик влажности и решил составить программу для
 * отслеживания времени полива.
 * На вход программа ждет дату последнего полива цветка.
 * Если сейчас зима (декабрь – февраль), то кактус поливается раз в месяц.
 * Если осень или весна, то раз в неделю.
 * Летом поливается в зависимости от влажности воздуха, но не чаще одного раза в два дня.
 * Значение влажности воздуха попадает в программу автоматически от датчика
 * (реализуйте через вызов метода класса Датчик, внутри которого будет генерация рандомного числа).
 * Если влажность ниже 30%, то цветок нужно полить.
 * Вася ожидает от программы, что после проверки всех данных, она выведет ему сообщение с датой, когда нужно поливать цветок.
 * Реализуйте программу, используя принципы ООП и библиотеки для работы с датой.
 */

import java.time.LocalDate;
import java.time.Month;

public class Main {
    public static void main(String[] args) {
        // Создание объекта цветка с датой последнего полива
        LocalDate lastWateringDate = LocalDate.of(2023, Month.AUGUST, 2);   //Ставим здесь дату последнего полива
        LocalDate localDateNow = LocalDate.now();   //Определим сегодняшнюю дату

        //Если дата указана некорректно, то ничего не считаем
        if(lastWateringDate.isAfter(localDateNow)){
            System.out.println("Дата полива (" + lastWateringDate + ") не корректна. Она позже текущей: " + localDateNow );
            return;
        }

        Flower flower = new Flower(lastWateringDate);   //Создадим цветок в указанную выше дату и польем его

        //В зависимости от реальной сегодняшней даты примем решение, не пора ли полить цветок
        if (flower.needsWatering()) {
            System.out.println("Цветок нужно полить сейчас.");
            //Установим, что полили цветок сегодня. Если вдруг захотим делать несколько запросов.
            flower.setLastWateringDate(localDateNow);
        } else {
            System.out.println("Цветок нужно полить " + flower.calculateNextWateringDate());
        }
    }
}